MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/* One rate point: select, run one clean burst, report. */
static bool matrix_point(capture_variant_t v, uint32_t want, bool show_regs)
{
    if (!capture_select_variant(v, want)) {
        console_kv("[matrix]   could not configure for ksps", want);
        return false;
    }
    if (show_regs) { capture_variant_regs(); }

    const uint32_t nominal = capture_variant_ksps();
    const uint32_t n       = 2u * capture_half_len();
    const uint32_t t0      = timebase_ticks();
    const uint32_t rc      = capture_oneshot();
    const uint32_t ticks   = timebase_ticks() - t0;
    (void)capture_settle();

    if (rc != 0u) {
        console_kv("[matrix]   ksps asked", want);
        console_puts("[matrix]     NO DATA - nothing converted\r\n");
        return false;
    }
    const uint32_t ksps = timebase_ksps(n, ticks);
    const uint32_t diff = (ksps > nominal) ? (ksps - nominal) : (nominal - ksps);
    const bool     ok   = (nominal != 0u) && (diff <= (nominal * MATRIX_TOL_PCT / 100u));

    /* Longest line: four numbers of at most 10 digits and about 70
     * characters of text, well inside 160. */
    char line[160];
    char *q = copy_str(line, "[matrix]   asked ");  q = u32_to_str(q, want);
    q = copy_str(q, "  nominal ");                  q = u32_to_str(q, nominal);
    q = copy_str(q, "  measured ");                 q = u32_to_str(q, ksps);
    q = copy_str(q, " ksps  -> ");
    q = copy_str(q, ok ? "follows" : "DOES NOT FOLLOW");
    copy_str(q, "\r\n");
    console_puts(line);

    /* Transfers per trigger, for the triggered variants: the trigger
     * period is exact, the transfer count is exactly one buffer, and the
     * window came from Timer1. */
    const uint32_t trig_ns = capture_trigger_period_ns();
    if ((trig_ns != 0u) && (ticks != 0u)) {
        const uint32_t window_ns = (uint32_t)(((uint64_t)ticks * 1000000000ull) / TIMEBASE_HZ);
        const uint32_t triggers  = window_ns / trig_ns;
        if (triggers != 0u) {
            console_kv("[matrix]     triggers in the window", triggers);
            console_kv("[matrix]     transfers per trigger x100", (n * 100u) / triggers);
        }
    }
    console_kv("[matrix]     overrun during the burst", dma_overrun);
    return ok;
}

static void cmd_matrix(void)
{
    struct matrix_result res[CAP_VAR_COUNT];
    console_puts("\r\n[matrix] every documented way to set the sample rate, tried on the board\r\n"
                 "[matrix] rate measured on one clean burst per point, never under load\r\n"
                 "[matrix] see sccp.h for the three errors this replaces\r\n");

    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        res[v].converts = false;
        res[v].rate_follows = false;
        res[v].checked = false;

        console_puts("\r\n[matrix] ");
        console_puts(capture_variant_name((capture_variant_t)v));
        console_puts("\r\n");

        uint32_t good = 0u;
        for (uint32_t i = 0; i < MATRIX_POINTS; i++) {
            if (matrix_point((capture_variant_t)v, matrix_ksps[i], i == 0u)) { good++; }
            if (blocks_done != 0u) { res[v].converts = true; }
        }
        res[v].rate_follows = (good == MATRIX_POINTS);
        console_puts(res[v].rate_follows
                     ? "[matrix]   VERDICT: the rate follows at every point\r\n"
                     : "[matrix]   VERDICT: not usable as a rate control\r\n");
    }

    /* The data check, only for what survived - one DAC capture each, so
     * the log stays readable. */
    console_puts("\r\n[matrix] data check on the variants whose rate followed\r\n");
    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        if (!res[v].rate_follows) { continue; }
        console_puts("[matrix] ");
        console_puts(capture_variant_name((capture_variant_t)v));
        console_puts("\r\n");
        if (capture_select_variant((capture_variant_t)v, 8000u)) {
            res[v].checked = (run_dactest(0u) == 0u);
        }
    }

    console_puts("\r\n[matrix] SUMMARY\r\n");
    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        char line[160];
        char *q = copy_str(line, "[matrix]   ");
        q = copy_str(q, res[v].rate_follows ? "RATE OK  " : "         ");
        q = copy_str(q, res[v].checked      ? "DATA OK  " : "         ");
        q = copy_str(q, capture_variant_name((capture_variant_t)v));
        copy_str(q, "\r\n");
        console_puts(line);
    }
    /* Back to a known state: the boot setting. */
    (void)capture_select_variant(CAP_VAR_B2B, capture_nominal_ksps(0u));
    (void)capture_set_pll(ADC_PLL_POSTDIV1, ADC_PLL_POSTDIV2);
    console_puts("[matrix] done - back at the boot setting\r\n");
}

static void test_list(void)
{
    put_line("test all   [halves]  - self, clock, sweep, dac in that order");
    put_line("test self            - ADC -> DMA -> RAM on the internal reference");
    put_line("test clock           - switch every CLKGEN6 ratio and read it back");
    put_line("test clkoff          - switch CLKGEN6 off: does the ADC still convert?");
    put_line("test matrix          - every way to set the rate, tried and measured");
    put_line("test rate  [halves]  - delivered rate at the ratio set now");
    put_line("test sweep [halves]  - the rate ladder, slowest first, with the counters");
    put_line("test dac   [halves]  - the DAC2 triangle: is everything there, in order?");
    put_line("pll <p1> <p2> sets the rate by hand; clk sets the (ineffective) CLKGEN6");
    put_line("ratio; regs prints the registers");
}

static void cmd_test_fn(int argc, char **argv)
{
    uint32_t halves = 0u;                  /* 0 = the part's own default */
    if (argc == 1) { test_list(); return; }
    if (argc > 3) { usage("test <all|self|clock|clkoff|matrix|rate|sweep|dac> [halves]"); return; }
    if ((argc == 3) && !arg_u32(argv[2], 1u, 100000u, &halves)) {
        usage("test <all|self|clock|clkoff|matrix|rate|sweep|dac> [halves]");
        return;
    }
    const char *what = argv[1];

    if (strcmp(what, "self") == 0) {
        if (!test_self()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clock") == 0) {
        if (!test_clock()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clkoff") == 0) {
        if (!test_clkoff()) { cmd_parser_fail(); }
    } else if (strcmp(what, "matrix") == 0) {
        cmd_matrix();
    } else if (strcmp(what, "rate") == 0) {
        if (!test_rate((halves != 0u) ? halves : TEST_RATE_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "sweep") == 0) {
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
    } else if (strcmp(what, "dac") == 0) {
        if (!test_dac((halves != 0u) ? halves : TEST_DAC_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "all") == 0) {
        console_puts("\r\n[test] ALL - self, clock, sweep, dac\r\n");
        (void)capture_set_clkdiv(ADC_CLKDIV);      /* start slow          */
        const bool self_ok = test_self();
        if (!self_ok) {
            /* The only part whose failure stops the rest: without a
             * working chain every number after it is meaningless. */
            console_puts("[test] ALL: STOPPED - the chain itself does not work\r\n");
            cmd_parser_fail();
            return;
        }
        const bool clock_ok = test_clock();
        (void)test_clkoff();
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
        const bool dac_ok = test_dac(TEST_DAC_HALVES);
        console_puts("\r\n[test] ALL DONE\r\n");
        console_puts(self_ok  ? "[test]   self:  PASS\r\n" : "[test]   self:  FAIL\r\n");
        console_puts(clock_ok ? "[test]   clock: PASS\r\n" : "[test]   clock: FAIL\r\n");
        console_puts("[test]   sweep: see the table above\r\n");
        console_puts(dac_ok   ? "[test]   dac:   PASS\r\n" : "[test]   dac:   FAIL\r\n");
        if (!clock_ok || !dac_ok) { cmd_parser_fail(); }
    } else {
        test_list();
        cmd_parser_fail();
    }
}
CMD_DEFINE(test, "test", cmd_test_fn, "test [all|self|clock|clkoff|matrix|rate|sweep|dac] [halves]");

